{
    "projects": [
        {
            "id": 1,
            "title": "CryptoDash - Cryptocurrency Market Dashboard",
            "subtitle": "Real-time cryptocurrency tracking patform",
            "badge": "Featured Project",
            "description": "Interactive dashboard for monitoring the cryptocurrency market in real time, consuming data from the CoinGecko API. The application allows you to view prices, percentage variation, market cap, rankings, price history, and individual details of each asset, with filters, search, and sorting.",
            "resultado_impacto": "As a result, the application delivers a fast, responsive, and intuitive dashboard for tracking prices, variations, market cap, rankings, and asset histories. The project strengthened skills in API consumption, data manipulation, and modern React development, in addition to becoming a central piece of the portfolio. CryptoDash contributes to facilitating access to real-time crypto market information and establishes a solid foundation for future evolutions, such as a customized watchlist, user authentication, and price alerts.",
            "desafios_solucoes": "The main challenge was developing a dashboard capable of handling a large volume of cryptocurrency market data in real time without compromising performance and user experience. To solve this, integration with the CoinGecko API was implemented, along with pagination, search, and sorting systems on the frontend, avoiding excessive requests and optimizing rendering. Loading components, error handling, and modular component organization were also applied, ensuring stability, predictability, and easy maintenance of the application.",
            "features": [
                "CoinGecko REST API Consumption",
                "Search by coin name or symbol",
                "Sort by Market Cap, price, and variation",
                "Paginated Cryptocurrency Listing",
                "Details page per asset",
                "Interactive historical charts",
                "Responsive layout and dark mode",
                "Loading and error handling",
                "Not Found Page",
                "SPA navigation using React Router"
            ],
            "technologies": [
                "React.JS", 
                "JavaScript (ES6+)", 
                "Tailwind CSS", 
                "CoinGecko API", 
                "Vite",
                "Proxy",
                "Git & Github",
                "Build & Deploy"
            ],
            "githubURL": "https://github.com/Lieberr/Crypto-Dash",
            "liveURL": "https://crypto-dash-kdzk.vercel.app/",
            "linkedin": "https://www.linkedin.com/posts/gustavo-lieb-figueira_react-fullstackdevelopment-tech-activity-7419525899609624576-5uyv?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAD1zvJkBNsIfzQFTWIC96Nf-s8N9gRqUhrE"
        },
        {
            "id": 2,
            "title": "ShopMate - Shopping Cart UI",
            "subtitle": "E-commerce interface with Context API and persistent cart",
            "badge": "Featured Project",
            "resultado_impacto": "As a result, the project delivers a functional, responsive, and intuitive e-commerce interface with a complete user interaction flow, from product navigation to cart management. ShopMate strengthened its skills in global state management, componentization, and data persistence on the frontend, in addition to demonstrating good architectural practices in React. The project has established itself as a highlight in the portfolio, demonstrating the ability to build scalable applications prepared for future evolutions, such as integration with payment gateways and user authentication.",
            "desafios_solucoes" : "The main challenge was implementing a shopping cart system that maintained consistent state throughout the application, even with multiple components accessing and modifying data simultaneously. To solve this problem, the Context API was used for global state management, centralizing the operations of adding, removing, and clearing the cart. In addition, a simulated API with JSON Server was integrated to provide dynamic product listing, along with data persistence in LocalStorage, ensuring that cart information was retained even after page reloads.",
            "description": "Front-end e-commerce application developed in React using Context API for global state management. The project simulates a complete shopping cart, with dynamic product listing via JSON Server, item addition and removal, header counter, complete cart clearing, persistence in LocalStorage, and a star rating system.",
            "features": [
               "Global state management with Context API",
                "Product listing via JSON Server",
                "Adding and removing items from cart",
                "Clearing cart",
                "Item counter in cart",
                "Data persistence with LocalStorage",
                "Rating system",
                "Responsive layout",
                "UI componentization and repurposing"
            ],
            "technologies": [
                "React.JS", 
                "Context API", 
                "JavaScript (ES6+)", 
                "Tailwind CSS", 
                "JSON Server",
                "LocalStorage",
                "Vite",
                "Mock API",
                "Git & Github",
                "Build & Deploy"
            ],
            "githubURL": "https://github.com/Lieberr/Shopping-Cart",
            "liveURL": "https://shopping-cart-4gm7.vercel.app/",
            "linkedin": "https://www.linkedin.com/posts/gustavo-lieb-figueira_reactjs-fullstackdevelopment-tech-activity-7421255454695239681-sKqg?utm_source=social_share_send&utm_medium=member_desktop_web&rcm=ACoAAD1zvJkBNsIfzQFTWIC96Nf-s8N9gRqUhrE"
        }
    ]
}